Revit 2027 API
FillPattern.LinesPerLength Property
 Gets the number of solid lines that placed in unit length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LinesPerLength { get; }
Public ReadOnly Property LinesPerLength As Double
	Get
public:
property double LinesPerLength {
	double get ();
}
member LinesPerLength : float with get
Property Value
Double
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace